#### Gözlem Değişken Seçimi

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=("Sutun 1","Sutun 2","Sutun 3"))
df

   Sutun 1  Sutun 2  Sutun 3
0       10       25       24
1       21       15       20
2        2       15       25
3        6       11       20
4       15       12       20
5       20       26       28
6       11       12       14
7       13       18       24
8        5       16       24
9       17       19       26

> loc: tanımlandığı şekli ile seçim yapmak için kullanılır. Yani üst sınırı da dahil ederek bir getirme işlemi yapar.

In [6]:
df.loc[0:3]

   Sutun 1  Sutun 2  Sutun 3
0       10       25       24
1       21       15       20
2        2       15       25
3        6       11       20

> iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar. Yani x'e kadar gider aşağıda da görüleceği gibi 0 dan 3 e kadar dediğimizde sadece 0,1ve 2 yi getirir.

In [7]:
df.iloc[0:3]

   Sutun 1  Sutun 2  Sutun 3
0       10       25       24
1       21       15       20
2        2       15       25

In [20]:
df.iloc[0:2,:] # örnek 1  Açılımı index location

   Sutun 1  Sutun 2  Sutun 3
0       10       25       24
1       21       15       20

In [15]:
df.loc[0:2,:]

   Sutun 1  Sutun 2  Sutun 3
0       10       25       24
1       21       15       20
2        2       15       25

In [19]:
df.loc[0:2]["Sutun 1"]

0    10
1    21
2     2
Name: Sutun 1, dtype: int32